devco/claim-mutations/a_block_sequence_cannot_hide_an_extra_push_hook.patch
--- a/xtask/src/hooks.rs
+++ b/xtask/src/hooks.rs
@@ -439,3 +439,3 @@
             }
-            if let Some(name) = trimmed.strip_prefix("- ") {
+            if let Some(name) = trimmed.strip_prefix("+ ") {
                 names.push(String::from(name.trim()));
