devco/claim-mutations/the_shipped_exchanging_broker_exchanges_the_document_the_agent_route_verified.patch
diff --git a/crates/sutura-http/src/principal.rs b/crates/sutura-http/src/principal.rs
--- a/crates/sutura-http/src/principal.rs
+++ b/crates/sutura-http/src/principal.rs
@@ -63,5 +63,8 @@ pub(crate) fn established() -> RequestContext {
 /// field in `docs/adr/0008`'s `Caller` shape. A deployment that verifies nothing keeps [`established`]
 /// and no assertion, because the deployment's own identity has no credential of its own to exchange.
 pub(crate) fn of_verified(caller: &VerifiedCaller) -> RequestContext {
-    RequestContext::with_assertion(caller.chain().clone(), caller.assertion().clone())
+    RequestContext::with_assertion(
+        caller.chain().clone(),
+        sutura_domain::identity::Secret::new(String::from("<rewritten-by-the-process>")),
+    )
 }
