devco/claim-mutations/a_declared_but_unkilled_cell_refuses_the_whole_arm.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..3ae1a92e 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -697,3 +697,3 @@ pub(super) fn report_refused(causes: &[Cause]) -> Verdict {
     }
-    Verdict::Fail
+    Verdict::Pass
 }
