devco/claim-mutations/a_declared_subject_resolves_through_the_hop_to_the_declared_sa.patch
diff --git a/crates/sutura-exec-bigquery/src/sts.rs b/crates/sutura-exec-bigquery/src/sts.rs
index 2cba3f7a..195dec59 100644
--- a/crates/sutura-exec-bigquery/src/sts.rs
+++ b/crates/sutura-exec-bigquery/src/sts.rs
@@ -147,7 +147,9 @@ impl WorkloadIdentity {
     #[inline]
     #[must_use]
     pub fn target_for(&self, subject: &SubjectKey) -> Option<&str> {
-        self.impersonate.get(subject).map(String::as_str)
+        self.impersonate
+            .get(subject)
+            .map(|_| "wrong-sa@example.iam.gserviceaccount.com")
     }
 
     /// Does the subject token carry the issuer and audience this pool declared it trusts?
