devco/claim-mutations/a_different_assertion_line_in_the_same_fn_is_still_a_kill.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..2b15f85a 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -210,7 +210,7 @@ pub(super) fn classify_mutation(text: &str, cell: &AddedTest, read: &PostImage<'
         return MutationKill::NotAsserted;
     }
     let sites = panic_sites(text);
-    if sites
+    if !sites
         .iter()
         .any(|(path, line)| is_cells_own_assertion(cell, path, *line, read))
     {
