devco/claim-mutations/a_duplicate_header_field_is_rejected.patch
diff --git a/crates/sutura-conformance/src/corpus/case_files.rs b/crates/sutura-conformance/src/corpus/case_files.rs
--- a/crates/sutura-conformance/src/corpus/case_files.rs
+++ b/crates/sutura-conformance/src/corpus/case_files.rs
@@ -376,7 +376,7 @@
                 });
             };
             if fields.iter().any(|&(seen, _)| seen == field) {
-                return Err(CaseError::DuplicateField { file, field });
+                return Err(CaseError::MissingField { file, field });
             }
             fields.push((field, value));
         }
