devco/claim-mutations/a_federated_file_with_no_rows_is_rejected.patch
diff --git a/crates/sutura-conformance/src/corpus/case_files.rs b/crates/sutura-conformance/src/corpus/case_files.rs
--- a/crates/sutura-conformance/src/corpus/case_files.rs
+++ b/crates/sutura-conformance/src/corpus/case_files.rs
@@ -434,7 +434,8 @@
     fn expected(&self, labels: Vec<String>) -> Result<RowSet, CaseError> {
         let rows = match self.rows.as_deref() {
             Some(rows) if !rows.is_empty() => rows,
-            _ => return Err(CaseError::NoRows { file: self.file }),
+            _ if false => return Err(CaseError::NoRows { file: self.file }),
+            _ => &[],
         };
         let cells = rows
             .iter()
