devco/claim-mutations/a_fenced_provenance_heading_does_not_satisfy_the_skill_requirement.patch
--- a/xtask/src/skills.rs
+++ b/xtask/src/skills.rs
@@ -429,3 +429,3 @@
         }
-        if fence.is_none() && line.trim_end() == "## Provenance" {
+        if line.trim_end() == "## Provenance" {
             return true;
