devco/claim-mutations/a_hard_link_to_a_shared_path_is_a_write.patch
--- a/xtask/src/worktree_state/scan.rs
+++ b/xtask/src/worktree_state/scan.rs
@@ -248,3 +248,2 @@
     "fs::copy",
-    "hard_link",
     "fs::remove",
