devco/claim-mutations/a_kill_by_a_pub_fns_own_assertion_is_the_kill.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..6cdf170b 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -300,2 +300,5 @@ fn test_fn_region(text: &str, name: &str, scope: &TestScope) -> Option<Range<usi
 fn fn_line_is(line: &str, name: &str) -> bool {
+    if !line.trim_start().starts_with("fn ") {
+        return false;
+    }
     function_name(line).is_some_and(|ident| ident.as_str() == name)
