devco/claim-mutations/a_kill_by_an_async_fns_own_assertion_is_the_kill.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..e0a7b578 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -300,2 +300,5 @@ fn test_fn_region(text: &str, name: &str, scope: &TestScope) -> Option<Range<usi
 fn fn_line_is(line: &str, name: &str) -> bool {
+    if line.contains("async") {
+        return false;
+    }
     function_name(line).is_some_and(|ident| ident.as_str() == name)
