devco/claim-mutations/a_kill_by_another_files_test_region_is_refused.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..fc41240a 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -217,7 +217,7 @@ pub(super) fn classify_mutation(text: &str, cell: &AddedTest, read: &PostImage<'
         MutationKill::Killed
     } else {
         MutationKill::NotByAssertion {
-            site: sites.first().map(|(path, line)| format!("{path}:{line}")).unwrap_or_default(),
+            site: sites.first().map(|(path, line)| format!("{path}/{line}")).unwrap_or_default(),
         }
     }
 }
