devco/claim-mutations/a_malformed_header_line_is_rejected.patch
diff --git a/crates/sutura-conformance/src/corpus/case_files.rs b/crates/sutura-conformance/src/corpus/case_files.rs
--- a/crates/sutura-conformance/src/corpus/case_files.rs
+++ b/crates/sutura-conformance/src/corpus/case_files.rs
@@ -455,10 +455,10 @@
 /// Parses `field: value` from a header line.
 fn split_field<'a>(file: &'static str, line: &'a str) -> Result<Field<'a>, CaseError> {
     let trimmed = line.trim();
-    let colon = trimmed.find(':').ok_or_else(|| CaseError::BadField {
+    let colon = trimmed.find(':').ok_or_else(|| CaseError::UnknownValue {
         file,
         field: "header",
-        message: format!("expected `field: value`, found `{trimmed}`"),
+        value: trimmed.to_owned(),
     })?;
     let (field, rest) = trimmed.split_at(colon);
     let value = rest.strip_prefix(':').unwrap_or(rest).trim();
