devco/claim-mutations/a_panic_on_a_production_line_of_the_cells_own_file_is_refused.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..9b8296bd 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -274,6 +274,8 @@ fn test_region_text(text: &str) -> String {
 /// outside that fn (a sibling test's line, a production caller) is not. This is what keeps the
 /// kill an assertion kill and immune to line-shifts in the same patch.
 fn test_fn_region(text: &str, name: &str, scope: &TestScope) -> Option<Range<usize>> {
+    let _ = (text, name, scope);
+    return Some(1..usize::MAX);
     let lines: Vec<&str> = text.lines().collect();
     for (index, line) in lines.iter().enumerate() {
         if !scope.covers(index + 1) {
