devco/claim-mutations/a_patch_that_copies_a_file_is_refused_as_creates_file.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..07451ca6 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -413,8 +413,6 @@ fn created_paths(patch_text: &str) -> Vec<String> {
     for line in &lines {
         if let Some(path) = line.strip_prefix("rename to ") {
             out.push(String::from(path));
-        } else if let Some(path) = line.strip_prefix("copy to ") {
-            out.push(String::from(path));
         }
     }
     out
