devco/claim-mutations/a_patch_that_does_not_apply_is_refused.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..4fe66852 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -534,10 +534,7 @@ fn validate(wt: &Path, claim: &Claim, added: &[&str], test_files: &[String]) ->
         }
         let touched = match touched_paths(wt, &patch) {
             Ok(paths) => paths,
-            Err(why) => {
-                causes.push(Cause::DoesNotApply { cell: cell.clone(), why });
-                continue;
-            }
+            Err(_why) => Vec::new(),
         };
         // The test-file rule is a PATH half and a TEXT half. The PATH half (`--numstat`) keeps
         // refusing a touch of a file that is all test at HEAD, or a diff-declared test file whose
@@ -556,10 +553,7 @@ fn validate(wt: &Path, claim: &Claim, added: &[&str], test_files: &[String]) ->
         // Snapshot the HEAD test-region text BEFORE the apply mutates the worktree; the same
         // reader afterwards reads the post-image.
         let before = head_region_texts(&touched, &read);
-        if let Err(why) = apply_git(wt, &patch, false) {
-            causes.push(Cause::DoesNotApply { cell: cell.clone(), why });
-            continue;
-        }
+        let _ = apply_git(wt, &patch, false);
         let rewritten = rewrites_cell_test_region(&before, &read);
         // RESTORE IS ON EVERY PATH and a failed restore is a cause: an apply this method leaves in
         // the tree would leak into the next cell's validate or kill run.
