devco/claim-mutations/a_patch_that_renames_a_file_is_refused_as_creates_file.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..cf14fb58 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -410,11 +410,2 @@ fn created_paths(patch_text: &str) -> Vec<String> {
     }
-    // A git rename/copy header names its created path on the `rename to`/`copy to` line (bare, no
-    // `b/` prefix): both tell git to WRITE a path HEAD does not carry, so both are creations.
-    for line in &lines {
-        if let Some(path) = line.strip_prefix("rename to ") {
-            out.push(String::from(path));
-        } else if let Some(path) = line.strip_prefix("copy to ") {
-            out.push(String::from(path));
-        }
-    }
     out
