devco/claim-mutations/a_patch_touching_a_diff_test_file_is_refused.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..98a49912 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -369,9 +369,6 @@ fn touches_test(touched: &[String], test_files: &[String], read: &PostImage<'_>)
     for path in touched {
         match test_scope(path, read) {
             TestScope::WholeFile => return Some(path.clone()),
-            TestScope::Regions(regions) if regions.is_empty() && test_files.contains(path) => {
-                return Some(path.clone());
-            }
             TestScope::Regions(_) => {}
         }
     }
