devco/claim-mutations/a_patch_touching_a_mixed_files_production_is_allowed.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..b1a90361 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -369,7 +369,7 @@ fn touches_test(touched: &[String], test_files: &[String], read: &PostImage<'_>)
     for path in touched {
         match test_scope(path, read) {
             TestScope::WholeFile => return Some(path.clone()),
-            TestScope::Regions(regions) if regions.is_empty() && test_files.contains(path) => {
+            TestScope::Regions(_) if test_files.contains(path) => {
                 return Some(path.clone());
             }
             TestScope::Regions(_) => {}
