devco/claim-mutations/a_patch_with_a_hunk_inside_a_test_region_is_refused.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..b2f0a3a7 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -450,6 +450,8 @@ fn head_region_texts(touched: &[String], read: &PostImage<'_>) -> Vec<(String, S
 /// production-only shift still matches. `before` is the snapshot taken pre-apply; `after` reads
 /// the worktree post-apply.
 fn rewrites_cell_test_region(before: &[(String, String)], after: &PostImage<'_>) -> Option<String> {
+    let _ = (before, after);
+    return None;
     before.iter().find_map(|(path, head_text)| {
         region_text_of(path, after)
             .filter(|post_text| post_text != head_text)
