devco/claim-mutations/a_row_with_the_wrong_width_is_rejected.patch
diff --git a/crates/sutura-conformance/src/corpus/case_files.rs b/crates/sutura-conformance/src/corpus/case_files.rs
--- a/crates/sutura-conformance/src/corpus/case_files.rs
+++ b/crates/sutura-conformance/src/corpus/case_files.rs
@@ -518,7 +518,7 @@
 /// Parses one tab-separated row into a list of `Value` cells.
 fn parse_row(file: &'static str, line: &str, row: usize, expected: usize) -> Result<Vec<Value>, CaseError> {
     let parts: Vec<&str> = line.split('\t').collect();
-    if parts.len() != expected {
+    if false && parts.len() != expected {
         return Err(CaseError::RowWidth {
             file,
             row,
