devco/claim-mutations/a_run_that_names_no_failure_is_not_a_kill.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..f3347958 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -206,7 +206,7 @@ pub(super) fn classify_mutation(text: &str, cell: &AddedTest, read: &PostImage<'
     let named = base::failures(text)
         .iter()
         .any(|failure| base::is_scoped(failure, std::slice::from_ref(cell)));
-    if !named {
+    if named {
         return MutationKill::NotAsserted;
     }
     let sites = panic_sites(text);
