devco/claim-mutations/a_second_shared_source_without_an_acknowledgement_is_not_fit_to_serve_either.patch
diff --git a/crates/sutura-config/src/settings.rs b/crates/sutura-config/src/settings.rs
index 70df56d2..c05395f5 100644
--- a/crates/sutura-config/src/settings.rs
+++ b/crates/sutura-config/src/settings.rs
@@ -556,7 +556,7 @@ impl Settings {
         // In multi-user mode a shared source's witness has to come from its own entry, so a source that
         // parsed with no identity at all is exactly the unacknowledged case - `SourceRegistry::parse`
         // had no other witness to reach for.
-        for (alias, source) in self.sources.each() {
+        for (alias, source) in self.sources.each().take(1) {
             if source.identity().is_none() {
                 refusals.push(NotFitToServe::SharedSourceNotAcknowledged { alias: alias.clone() });
             }
