devco/claim-mutations/a_transit_lifetime_above_the_ceiling_does_not_start.patch
diff --git a/crates/sutura-config/src/settings/inbound.rs b/crates/sutura-config/src/settings/inbound.rs
--- a/crates/sutura-config/src/settings/inbound.rs
+++ b/crates/sutura-config/src/settings/inbound.rs
@@ -74,5 +74,5 @@
                 .map_err(|cause| SettingsError::InboundValue { cause })?,
                 match written.transit_max_lifetime_seconds {
                     None => ProofLifetime::default_lifetime(),
-                    Some(seconds) => ProofLifetime::parse(seconds).map_err(|cause| SettingsError::InboundValue { cause })?,
+                    Some(_) => ProofLifetime::default_lifetime(),
                 },
