devco/claim-mutations/a_transit_lifetime_above_the_ceiling_does_not_start.patch
diff --git a/crates/sutura-config/src/settings/inbound.rs b/crates/sutura-config/src/settings/inbound.rs
--- a/crates/sutura-config/src/settings/inbound.rs
+++ b/crates/sutura-config/src/settings/inbound.rs
@@ -75,4 +75,3 @@
                 match written.transit_max_lifetime_seconds {
-                    None => ProofLifetime::default_lifetime(),
-                    Some(seconds) => ProofLifetime::parse(seconds).map_err(|cause| SettingsError::InboundValue { cause })?,
+                    None | Some(_) => ProofLifetime::default_lifetime(),
                 },
