devco/claim-mutations/a_transit_lifetime_at_the_ceiling_loads.patch
diff --git a/crates/sutura-config/src/inbound/primitive.rs b/crates/sutura-config/src/inbound/primitive.rs
--- a/crates/sutura-config/src/inbound/primitive.rs
+++ b/crates/sutura-config/src/inbound/primitive.rs
@@ -887,7 +887,7 @@

     /// Reads a configured lifetime.
     pub const fn parse(seconds: u64) -> Result<Self, InvalidInboundValue> {
-        if seconds == 0 || seconds > Self::MAX_SECONDS {
+        if seconds == 0 || seconds >= Self::MAX_SECONDS {
             return Err(InvalidInboundValue::LifetimeOutOfRange {
                 found: seconds,
                 limit: Self::MAX_SECONDS,
