devco/claim-mutations/an_unreachable_subtree_refuses_the_scan_rather_than_shrinking_it.patch
diff --git a/xtask/src/repo/census.rs b/xtask/src/repo/census.rs
index 06d89f9d..ebab7b7f 100644
--- a/xtask/src/repo/census.rs
+++ b/xtask/src/repo/census.rs
@@ -305,7 +305,7 @@ impl Census {
     ) -> Result<Inspected, Refusal> {
         // BEFORE the loop: a partial tree makes every number below a number about a subset, so
         // there is nothing worth inspecting yet.
-        if !self.unreachable.is_empty() {
+        if !self.unreachable.is_empty() && false {
             return Err(Refusal::Unreachable(self.unreachable));
         }
         if self.of.is_empty() {
