devco/claim-mutations/deleting_an_existing_assertion_is_refused.patch
--- a/xtask/src/causality/plan.rs
+++ b/xtask/src/causality/plan.rs
@@ -171,3 +171,3 @@
     // test rather than guessing it away.
-    if !deleted_tests.is_empty() {
+    if deleted_tests.len() > files.len() {
         return Plan::DeletedTests(deleted_tests);
