devco/claim-mutations/editing_a_called_test_helper_is_refused_without_a_claim.patch
--- a/xtask/src/causality/edited.rs
+++ b/xtask/src/causality/edited.rs
@@ -129,4 +129,3 @@
     let lines: Vec<&str> = text.lines().collect();
-    let scope = crate::causality::regions::scope(path, read);
-    !touched_in(&lines, added).is_empty() || !edited_helper_caller(&lines, added, &scope).is_empty()
+    !touched_in(&lines, added).is_empty()
 }
