devco/claim-mutations/high_iowait_with_low_user_system_reads_as_not_busy.patch
diff --git a/nix/cpu-busy.sh b/nix/cpu-busy.sh
index b7cc3a55..ed6c772e 100755
--- a/nix/cpu-busy.sh
+++ b/nix/cpu-busy.sh
@@ -30,7 +30,7 @@ cpu_busy() {
             m = split(cur, c, " ")
             pt = 0; ct = 0; pidle = 0; cidle = 0
             for (i = 2; i <= n; i++) { pt += p[i]; if (i == 5 || i == 6) pidle += p[i] }
-            for (i = 2; i <= m; i++) { ct += c[i]; if (i == 5 || i == 6) cidle += c[i] }
+            for (i = 2; i <= m; i++) { ct += c[i]; if (i == 5) cidle += c[i] }
             dt = ct - pt; di = cidle - pidle
             if (dt > 0) printf "%.1f\n", 100 * (dt - di) / dt
         }
