devco/claim-mutations/the_accepted_arm_prints_and_passes.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..863f4d85 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -765,3 +765,3 @@ pub(super) fn report_accepted(declared: usize, killed: usize) -> Verdict {
     }
-    Verdict::Pass
+    Verdict::Fail
 }
