devco/claim-mutations/the_arm_refuses_a_declared_cell_that_has_no_patch.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..7bf2f396 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -672,7 +672,7 @@ pub(super) fn run(root: &Path, scoped: &Scoped, test_files: &[String], claim: &C
     let causes = validate(&wt, claim, &added, test_files);
     if !causes.is_empty() {
         worktree::remove_worktree(root, &wt);
-        return report_refused(&causes);
+        return report_accepted(1, 1);
     }

     let declared = claim.cells().len();
