devco/claim-mutations/the_claim_is_deduped_sorted_and_absent_without_a_trailer.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..2b4e69bf 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -108,7 +108,6 @@ impl Claim {
             .lines()
             .filter_map(|line| line.trim().strip_prefix(TRAILER))
             .map(|rest| String::from(rest.trim()))
-            .filter(|name| !name.is_empty())
             .collect::<BTreeSet<String>>()
             .into_iter()
             .collect();
