devco/claim-mutations/the_numstat_reader_names_what_git_would_rewrite.patch
diff --git a/xtask/src/causality/claim.rs b/xtask/src/causality/claim.rs
index 3126ba93..5a113074 100644
--- a/xtask/src/causality/claim.rs
+++ b/xtask/src/causality/claim.rs
@@ -327,7 +327,7 @@ fn mutation_path(dir: &Path, cell: &str) -> PathBuf {
 fn numstat_paths(numstat: &str) -> Vec<String> {
     numstat
         .lines()
-        .filter_map(|line| line.split('\t').nth(2))
+        .filter_map(|line| line.split('\t').nth(0))
         .map(String::from)
         .collect()
 }
