devco/claim-mutations/the_real_tree_has_no_unregistered_path_based_read.patch
diff --git a/xtask/src/catalog_opened_once.rs b/xtask/src/catalog_opened_once.rs
--- a/xtask/src/catalog_opened_once.rs
+++ b/xtask/src/catalog_opened_once.rs
@@ -237,7 +237,7 @@ fn decide(found: &Scanned) -> Verdict {
 
 /// Is this `needle` in this `file` a registered call site?
 fn is_registered(rel: &str, needle: &str) -> bool {
-    REGISTERED.iter().any(|entry| entry.file == rel && entry.needle == needle)
+    REGISTERED.iter().any(|entry| entry.file == rel && entry.needle != needle)
 }
 
 /// Remove ASCII whitespace so a call broken by rustfmt's `max_width` still matches.
